Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: '%@' has no primary key, so identical rows cannot be told apart. Add a primary key, or edit the rows with a query.
fr: «%@» n'a pas de clé primaire, donc des lignes identiques ne peuvent pas être distinguées. Ajoutez une clé primaire ou modifiez les lignes avec une requête.
ko: '%@'에 기본 키가 없어 동일한 행을 구분할 수 없습니다. 기본 키를 추가하거나 쿼리로 행을 편집하십시오.
tr: '%@' birincil anahtara sahip değil, bu yüzden aynı satırlar birbirinden ayırt edilemiyor. Bir birincil anahtar ekleyin veya satırları bir sorguyla düzenleyin.
vi: '%@' không có khoá chính nên không thể phân biệt các dòng giống nhau. Hãy thêm khoá chính, hoặc sửa các dòng bằng truy vấn.
zh_hans: '%@' 没有主键，因此无法区分完全相同的行。请添加主键，或用查询编辑这些行。
zh_hant: '%@' 沒有主鍵，因此無法區分完全相同的列。請新增主鍵，或用查詢編輯這些列。

source: Create %@
fr: Créer %@
ko: %@ 생성
tr: %@ Oluştur
vi: Tạo %@
zh_hans: 创建 %@
zh_hant: 建立 %@

source: Connection status
fr: Statut de la connexion
ko: 연결 상태
tr: Bağlantı durumu
vi: Trạng thái kết nối
zh_hans: 连接状态
zh_hant: 連線狀態

source: This value is too large to parse. Use raw mode to inspect it as text.
fr: Cette valeur est trop grande pour être analysée. Utilisez le mode brut pour l'inspecter sous forme de texte.
ko: 이 값은 구문 분석하기에 너무 큽니다. 원시 모드에서 텍스트로 확인하십시오.
tr: Bu değer ayrıştırılamayacak kadar büyük. Metin olarak incelemek için ham modu kullanın.
vi: Giá trị này quá lớn để phân tích. Dùng chế độ raw để xem dưới dạng văn bản.
zh_hans: 此值太大，无法解析。请使用原始模式以文本形式查看。
zh_hant: 此值太大，無法解析。請使用原始模式以文字形式檢視。

source: Only folders available in all connections can hold a global query.
fr: Seuls les dossiers disponibles dans toutes les connexions peuvent contenir une requête globale.

source: slash
fr: barre oblique
ko: 슬래시
tr: eğik çizgi
vi: dấu gạch chéo
zh_hans: 斜杠
zh_hant: 斜線

source: Not connected to ClickHouse
fr: Non connecté à ClickHouse
ko: ClickHouse에 연결되지 않음
tr: ClickHouse'a bağlı değil
vi: Chưa kết nối đến ClickHouse
zh_hans: 未连接到 ClickHouse
zh_hant: 未連線到 ClickHouse

source: Backup Database
fr: Base de données de sauvegarde
ko: 데이터베이스 백업
tr: Veritabanını Yedekle
vi: Sao lưu cơ sở dữ liệu
zh_hans: 备份数据库
zh_hant: 備份資料庫

source: Startup Commands
fr: Commandes de démarrage
ko: 시작 명령
tr: Başlangıç Komutları
vi: Lệnh khởi động
zh_hans: 启动命令
zh_hant: 啟動指令

source: Smooth
fr: Lisse
ko: 부드럽게
vi: Mượt
zh_hans: 平滑
zh_hant: 平滑

source: Disconnect from a database
fr: Se déconnecter d'une base de données
ko: 데이터베이스 연결 해제
tr: Bir veritabanı bağlantısını kes
vi: Ngắt kết nối khỏi cơ sở dữ liệu
zh_hans: 断开数据库连接
zh_hant: 中斷與資料庫的連線

source: Show Previous Tab
fr: Afficher la barre d'onglets précéd
ko: 이전 탭 보기
tr: Önceki Sekmeyi Göster
vi: Hiện tab trước
zh_hans: 显示上一个标签页
zh_hant: 顯示上一個分頁

source: New table
fr: Nouvelle table
ko: 새 테이블
tr: Yeni tablo
vi: Bảng mới
zh_hans: 新建表
zh_hant: 新增資料表

source: The dump is replayed into this database. Objects that already exist are kept, not replaced, and the dump's data is added to them. The change cannot be undone.
fr: Le déballage est reproduit dans cette base de données. Les objets qui existent déjà sont conservés, non remplacés, et les données du déballage sont ajoutées à eux. Le changement ne peut pas être annulé.

source: Move Rule Up
fr: Mettre la règle en haut

source: Skipped %@: no endpoint yet.
fr: Évité %@ : pas encore d'extrémité de bout.

source: The instance connection name must be in the form project:region:instance.
fr: Le nom de connexion de l'instance doit être au format projet:région:instance.
ko: 인스턴스 연결 이름은 project:region:instance 형식이어야 합니다.
tr: Örnek bağlantı adı project:region:instance biçiminde olmalıdır.
vi: Tên kết nối instance phải theo dạng project:region:instance.
zh_hans: 实例连接名称必须为 project:region:instance 形式。
zh_hant: 執行個體連線名稱必須為 project:region:instance 形式。

source: Database now selected
fr: Base de données maintenant sélectionnée
ko: 현재 선택된 데이터베이스
tr: Şu anda seçili veritabanı
vi: Cơ sở dữ liệu đang được chọn
zh_hans: 当前已选中的数据库
zh_hant: 目前已選取的資料庫

source: This plugin is signed by %@, a developer you have not trusted yet.
fr: Ce plugin est signé par %@, un développeur que vous n'avez pas encore confiance.
ko: %@ 개발자가 서명한 플러그인입니다. 이 개발자는 아직 신뢰하지 않았습니다.
tr: Bu eklenti %@ tarafından imzalandı; bu geliştiriciye henüz güvenmediniz.
vi: Plugin này được ký bởi %@, một nhà phát triển mà bạn chưa tin cậy.
zh_hans: 此插件由 %@ 签名，你尚未信任该开发者。
zh_hant: 此外掛由 %@ 簽署，你尚未信任該開發者。

source: About TablePro
fr: À propos de TablePro
ko: TablePro에 관하여
tr: TablePro Hakkında
vi: Giới thiệu TablePro
zh_hans: 关于 TablePro
zh_hant: 關於 TablePro

source: Install one from PostgreSQL %@ or earlier.
fr: Installez-en un à partir de PostgreSQL %@ ou plus ancien.

source: New Subgroup…
fr: Nouveau sous-groupe...
ko: 새 하위 그룹…
tr: Yeni Alt Grup…
vi: Nhóm con mới…
zh_hans: 新建子分组…
zh_hant: 新增子群組…

source: A built-in plugin "%@" already provides this bundle ID
fr: Un plugin intégré "%@" fournit déjà cet identifiant de paquets.
ko: 기본 제공 플러그인 "%@"에서 이미 이 번들 ID를 제공합니다
tr: A built-giriş plugin "%@" already provides this bundle ID
vi: Plugin tích hợp "%@" đã cung cấp bundle ID này
zh_hans: 内置插件 "%@" 已提供此 bundle ID
zh_hant: 內建外掛「%@」已提供此 bundle ID

source: WARNING: The host key for '%1$@' has changed! This could mean someone is doing something malicious, or the server was reinstalled. Previous fingerprint: %2$@ Current fingerprint: %3$@
fr: AVERTISSEMENT : La clé d'hôte pour '%1$@' a changé ! Cela pourrait signifier que quelqu'un fait quelque chose de malveillant, ou que le serveur a été réinstallé. empreinte digitale précédente : %2$@ empreinte digitale actuelle : %3$@
ko: 경고: '%1$@'의 호스트 키가 변경되었습니다! 누군가 악의적인 작업을 시도하고 있거나 서버가 재설치되었을 수 있습니다. 이전 지문: %2$@ 현재 지문: %3$@
tr: UYARI: '%@' sunucusunun anahtarı değişti! Bu, birinin kötü niyetli bir şey yaptığı anlamına gelebilir veya sunucu yeniden kurulmuş olabilir. Önceki parmak izi: %@ Geçerli parmak izi: %@
vi: CẢNH BÁO: Khóa máy chủ của '%@' đã thay đổi! Điều này có thể do ai đó đang tấn công, hoặc máy chủ đã được cài đặt lại. Vân tay trước: %@ Vân tay hiện tại: %@
zh_hans: 警告：主机 '%@' 的密钥已更改！ 这可能意味着有人进行恶意操作，或者服务器已被重新安装。 之前的指纹：%@ 当前指纹：%@
zh_hant: 警告：主機 '%1$@' 的主機金鑰已變更！ 這可能表示有人正進行惡意操作，或伺服器已重新安裝。 先前的指紋：%2$@ 目前的指紋：%3$@

source: Match all
fr: Correspondre à tout
ko: 모두 일치
tr: Tümüyle eşleştir
vi: Khớp tất cả
zh_hans: 匹配全部
zh_hant: 全部符合

source: An extension runs inside TablePro with full access to your Mac. Load them only if you trust these files.
fr: Une extension s'exécute à l'intérieur de TablePro avec un accès complet à votre Mac. Chargez-les uniquement si vous faites confiance à ces fichiers.

source: Number of documents per insertMany statement. Higher values create fewer statements.
fr: Nombre de documents par inséré Nombreux relevés. Les valeurs plus élevées créent moins de relevés.
ko: insertMany 명령문당 문서 수입니다. 값이 클수록 생성되는 명령문 수가 줄어듭니다.
vi: Số lượng document cho mỗi câu lệnh insertMany. Giá trị cao hơn tạo ít câu lệnh hơn.
zh_hans: 每个 insertMany 语句的文档数量。值越大生成的语句越少。
zh_hant: 每個 insertMany 陳述式的文件數量。值越大產生的陳述式越少。

source: Edit Row
fr: Modifier la ligne
ko: 행 편집
tr: Satırı Düzenle
vi: Sửa dòng
zh_hans: 编辑行
zh_hant: 編輯列

source: Couldn't Discard Changes
fr: Impossible de rejeter les modifications

source: in list
fr: Dans la liste
ko: 목록에 있음
tr: listede
vi: trong danh sách
zh_hans: 在列表中
zh_hant: 在清單中

source: 1 statement, %d will run.
fr: 1 déclaration, %d sera exécutée.
ko: 구문 1개 중 %d개를 실행합니다.
tr: 1 ifade, %d tanesi çalışacak.
vi: 1 câu lệnh, %d sẽ chạy.
zh_hans: 共 1 条语句，将运行 %d 条。
zh_hant: 共 1 條陳述式，將執行 %d 條。

source: SSH password rejected. Check the password and try again.
fr: Mot de passe SSH rejeté. Vérifiez le mot de passe et réessayez.
ko: SSH 암호가 거부되었습니다. 암호를 확인하고 다시 시도하십시오.
tr: SSH parolası reddedildi. Parolayı denetleyip yeniden deneyin.
vi: Mật khẩu SSH bị từ chối. Kiểm tra mật khẩu và thử lại.
zh_hans: SSH 密码被拒绝。请检查密码后重试。
zh_hant: SSH 密碼被拒絕。請檢查密碼後再試一次。

source: Last 7 days
fr: Derniers 7 jours
ko: 최근 7일
tr: Son 7 gün
vi: 7 ngày qua
zh_hans: 过去 7 天
zh_hant: 過去 7 天

source: This file is not a valid TablePro export
fr: Ce fichier n'est pas une exportation valide de TablePro.
ko: 이 파일은 올바른 TablePro 내보내기 파일이 아닙니다
tr: Bu dosya geçerli bir TablePro dışa aktarma dosyası değil
vi: Tệp này không phải là tệp xuất TablePro hợp lệ
zh_hans: 此文件不是有效的 TablePro 导出文件
zh_hant: 此檔案不是有效的 TablePro 匯出檔

source: Search tables, views, databases...
fr: Rechercher des tables, des vues, des bases de données...
ko: 테이블, 뷰, 데이터베이스 검색...
vi: Tìm bảng, view, cơ sở dữ liệu...
zh_hans: 搜索表、视图、数据库...
zh_hant: 搜尋資料表、檢視表、資料庫…

source: Rule operator
fr: Opérateur de règle

source: Auth Method
fr: Méthode d'authentification
ko: 인증 방식
tr: Kimlik Doğrulama Yöntemi
vi: Phương thức xác thực
zh_hans: 认证方式
zh_hant: 驗證方式

source: No servers yet.
fr: Pas encore de serveurs.

source: Stop Server Session
fr: Arrêter la session du serveur
ko: 서버 세션 중지
tr: Sunucu Oturumunu Durdur
vi: Dừng phiên máy chủ
zh_hans: 停止服务器会话
zh_hant: 停止伺服器工作階段

source: %@ stops being a partial index
fr: %@ cesse d'être un indice partiel

source: Drop %1$@ “%2$@”?
fr: Déposez %1$@ "%2$@"?
ko: %1$@ “%2$@”을(를) 삭제하시겠습니까?
tr: %1$@ “%2$@” bırakılsın mı?
vi: Xóa %1$@ “%2$@”?
zh_hans: 删除%1$@“%2$@”？
zh_hant: 刪除%1$@「%2$@」？

source: Loading keys…
fr: Chargement des clés...
ko: 키 불러오는 중…
tr: Anahtarlar yükleniyor…
vi: Đang tải khóa…
zh_hans: 正在加载键…
zh_hant: 正在載入鍵…

source: SQL dialect for %@ is not available. The plugin may not be installed or loaded.
fr: Le dialecte SQL pour %@ n'est pas disponible. Le plugin peut ne pas être installé ou chargé.
ko: %@용 SQL 방언을 사용할 수 없습니다. 플러그인이 설치되지 않았거나 로드되지 않았을 수 있습니다.
tr: %@ için SQL diyalekti kullanılamıyor. Eklenti kurulmamış veya yüklenmemiş olabilir.
vi: Không có dialect SQL cho %@. Plugin có thể chưa được cài đặt hoặc tải.
zh_hans: %@ 的 SQL 方言不可用。插件可能未安装或未加载。
zh_hant: %@ 的 SQL 方言無法使用。外掛可能尚未安裝或載入。

source: List the databases on the server, sorted by name.
fr: Listez les bases de données sur le serveur, triées par nom.
ko: 서버의 데이터베이스를 이름순으로 나열합니다.
tr: Sunucudaki veritabanlarını ada göre sıralayarak listeler.
vi: Liệt kê các cơ sở dữ liệu trên máy chủ, sắp xếp theo tên.
zh_hans: 列出服务器上的数据库，按名称排序。
zh_hant: 列出伺服器上的資料庫，按名稱排序。

source: Import into Table
fr: Importer dans la table

source: inserting %d row(s)
fr: Insérer %d rangée(s)
ko: %d개 행 삽입
tr: %d satır ekleme
vi: chèn %d dòng
zh_hans: 插入 %d 行
zh_hant: 插入 %d 列

source: This database reports no objects.
fr: Cette base de données ne rapporte aucun objet.

source: quotation mark
fr: Point d'interrogation
ko: 큰따옴표
tr: çift tırnak
vi: dấu ngoặc kép
zh_hans: 双引号
zh_hant: 雙引號

source: Insert Column Before
fr: Insérer la colonne avant
ko: 앞에 열 삽입
tr: Öncesine Sütun Ekle
vi: Chèn cột trước
zh_hans: 在前面插入列
zh_hant: 在前方插入欄位

source: API key set
fr: Ensemble de clés API
ko: API 키 설정됨
tr: API anahtarı ayarlı
vi: Đã đặt API key
zh_hans: 已设置 API 密钥
zh_hant: 已設定 API key

source: Nothing to Restore
fr: Rien à restaurer
ko: 복원할 항목 없음
tr: Geri Yüklenecek Bir Şey Yok
vi: Không có gì để khôi phục
zh_hans: 没有可恢复的内容
zh_hant: 沒有可還原的內容

source: TablePro Website
fr: Site Web de TablePro
ko: TablePro 웹사이트
vi: Trang web TablePro
zh_hans: TablePro 网站
zh_hant: TablePro 網站

source: Loading dashboard…
fr: Chargement du tableau de bord...
ko: 대시보드 불러오는 중…
tr: Pano yükleniyor…
vi: Đang tải bảng điều khiển…
zh_hans: 正在加载仪表盘…
zh_hant: 正在載入儀表板…

# %1$@ chart of %2$@ by %3$@ with %4$d points
source: %1$@ chart of %2$@ by %3$@ with %d points
fr: %1$@ graphique de %2$@ par %3$@ avec %#@points@
ko: %3$@ 기준 %2$@의 %1$@ 차트, 지점 %d개
tr: %3$@ ölçütüne göre %2$@ için %4$d noktalı %1$@ grafiği
vi: Biểu đồ %1$@ của %2$@ theo %3$@ với %4$d điểm
zh_hans: 包含 %4$d 个点的%1$@图：按%3$@显示%2$@
zh_hant: 包含 %4$d 個點的%1$@圖：依%3$@顯示%2$@

source: Test Connection
fr: Test de connexion
ko: 연결 테스트
tr: Bağlantıyı Test Et
vi: Kiểm tra kết nối
zh_hans: 测试连接
zh_hant: 測試連線

source: Rows in %@ changed after they were compared. Compare again before generating the script.
fr: Les lignes en %@ ont changé après leur comparaison. Comparez à nouveau avant de générer le script.

source: Instance connection name must be project:region:instance
fr: Le nom de connexion de l'instance doit être projet:région:instance.
ko: 인스턴스 연결 이름은 project:region:instance 형식이어야 합니다
tr: Örnek bağlantı adı project:region:instance biçiminde olmalı
vi: Tên kết nối instance phải theo dạng project:region:instance
zh_hans: 实例连接名称必须为 project:region:instance
zh_hant: 執行個體連線名稱必須為 project:region:instance

source: Insert Column
fr: Insérer une colonne
ko: 열 삽입
tr: Sütun Ekle
vi: Chèn cột
zh_hans: 插入列
zh_hant: 插入欄位

source: This statement is too long to send (%d characters). Select a smaller part of it.
fr: Cette déclaration est trop longue pour être envoyée (%d caractères). Sélectionnez une partie plus petite.

source: Cloudflare tunnel disconnected. Click to reconnect.
fr: Le tunnel Cloudflare est déconnecté. Cliquez pour vous reconnecter.
ko: Cloudflare 터널의 연결이 끊어졌습니다. 클릭하여 다시 연결하십시오.
tr: Cloudflare tüneli kesildi. Yeniden bağlanmak için tıklayın.
vi: Cloudflare tunnel đã ngắt kết nối. Bấm để kết nối lại.
zh_hans: Cloudflare隧道已断开。点按以重新连接。
zh_hant: Cloudflare 隧道已中斷。點按以重新連線。

source: SQL INSERT statements. Use to recreate data in another database.
fr: Statements SQL INSERT. Utilisez-les pour recréer des données dans une autre base de données.
ko: SQL INSERT 문입니다. 다른 데이터베이스에 데이터를 다시 생성할 때 사용합니다.
tr: SQL INSERT ifadeleri. Başka bir veritabanında veri yeniden oluşturmak için kullanın.
vi: Câu lệnh SQL INSERT. Dùng để tạo lại dữ liệu trong cơ sở dữ liệu khác.
zh_hans: SQL INSERT 语句。用于在其他数据库中重建数据。
zh_hant: SQL INSERT 陳述式。用於在其他資料庫中重建資料。

source: Create New Profile…
fr: Créer un nouveau profil...
ko: 새 프로필 생성…
tr: Yeni Profil Oluştur…
vi: Tạo hồ sơ mới…
zh_hans: 新建配置…
zh_hant: 建立新設定檔…

source: %d rows selected
fr: %d lignes sélectionnées

source: The target's object is dropped and built again from the source.
fr: L'objet de la cible est déposé et construit à nouveau à partir de la source.

source: Copy All
fr: Copier tout
ko: 모두 복사
tr: Tümünü Kopyala
vi: Sao chép tất cả
zh_hans: 全部复制
zh_hant: 全部複製

source: Foreign Keys
fr: Clés étrangères
ko: 외래 키
tr: Yabancı Anahtarlar
vi: Khóa ngoại
zh_hans: 外键
zh_hant: 外鍵

source: Bytes carried since the transport opened.
fr: Bytes transportés depuis l'ouverture du transport.

source: Drop database “%@”?
fr: Supprimer la base de données "%@"?
ko: 데이터베이스 “%@”을(를) 삭제하시겠습니까?
tr: “%@” veritabanı silinsin mi?
vi: Xóa cơ sở dữ liệu “%@”?
zh_hans: 要删除数据库“%@”吗？
zh_hant: 要捨棄資料庫「%@」嗎？

source: FAST
fr: Rapide
tr: HIZLI
vi: NHANH
zh_hans: 快速
zh_hant: 快速

source: The source could not be read: %@
fr: La source n'a pas pu être lu : %@

source: Applying to %@…
fr: Postuler à %@...
ko: %@에 적용하는 중…
tr: %@ üzerine uygulanıyor…
vi: Đang áp dụng vào %@…
zh_hans: 正在应用到 %@…
zh_hant: 正在套用到 %@…

source: Keep Restoring
fr: Continuez à restaurer
ko: 복원 계속
tr: Geri Yüklemeye Devam Et
vi: Tiếp tục khôi phục
zh_hans: 继续恢复
zh_hant: 繼續還原

source: That Mac keeps working until its next check, within 7 days, and then Pro features pause there.
fr: Ce Mac continue de fonctionner jusqu'à son prochain contrôle, dans les 7 jours, et ensuite les fonctionnalités Pro s'arrêtent là.
ko: 해당 Mac은 7일 이내의 다음 확인까지 계속 작동하며, 그 후 Pro 기능이 일시 중지됩니다.
tr: O Mac, 7 gün içindeki bir sonraki denetime kadar çalışmayı sürdürür, ardından Pro özellikleri orada duraklar.
vi: Máy Mac đó vẫn hoạt động cho đến lần kiểm tra kế tiếp trong vòng 7 ngày, sau đó các tính năng Pro sẽ tạm dừng ở đó.
zh_hans: 那台 Mac 会持续使用到 7 天内的下次检查，之后 Pro 功能会在该设备上暂停。
zh_hant: 那台 Mac 會持續使用到 7 天內的下次檢查，之後 Pro 功能會在該裝置上暫停。

source: This foreign key needs the columns it references.
fr: Cette clé étrangère a besoin des colonnes qu'elle renvoie.

source: Replacing…
fr: Remplaçant...

source: %@ loses its default
fr: %@ perd son défaut

source: Digits
fr: Chiffres
ko: 자릿수
tr: Rakamlar
vi: Số chữ số
zh_hans: 位数
zh_hant: 位數

source: Node Changes
fr: Changements de nœud
ko: 노드 변경 사항
tr: Düğüm Değişiklikleri
vi: Thay đổi nút
zh_hans: 节点变化
zh_hant: 節點變更

source: No Microsoft Entra ID access token was supplied.
fr: Aucun jeton d'accès Microsoft Entra ID n'a été fourni.
ko: Microsoft Entra ID 액세스 토큰이 제공되지 않았습니다.
tr: Microsoft Entra ID erişim belirteci sağlanmadı.
vi: Không có access token Microsoft Entra ID nào được cung cấp.
zh_hans: 未提供 Microsoft Entra ID 访问令牌。
zh_hant: 未提供 Microsoft Entra ID 存取權杖。

source: Explain variant id for this engine. Call with no variant to see the list.
fr: Expliquez l'identifiant de la variante pour ce moteur. Appelez sans variante pour voir la liste.
ko: 이 엔진의 EXPLAIN 변형 id입니다. 목록을 보려면 변형 없이 호출하십시오.
tr: Bu motor için açıklama varyantı kimliği. Listeyi görmek için varyant vermeden çağırın.
vi: Id biến thể EXPLAIN cho engine này. Gọi mà không truyền biến thể để xem danh sách.
zh_hans: 此引擎的 EXPLAIN 变体 id。不带变体调用即可查看列表。
zh_hant: 此引擎的 EXPLAIN 變體 id。不帶變體呼叫即可查看清單。

source: Copy Definition
fr: Définition de la copie
ko: 정의 복사
tr: Tanımı Kopyala
vi: Sao chép định nghĩa
zh_hans: 复制定义
zh_hant: 複製定義

source: Whether this export was clipped
fr: Que cette exportation ait été coupée ou non
ko: 이 내보내기가 잘렸는지 여부
tr: Bu dışa aktarmanın kırpılıp kırpılmadığı
vi: Bản xuất này có bị cắt bớt hay không
zh_hans: 此次导出是否被截断
zh_hant: 此次匯出是否被截斷

source: Could not write to file. Check that the file is writable.
fr: Impossible d'écrire dans le fichier. Vérifiez que le fichier est écritible.
ko: 파일에 쓸 수 없습니다. 파일에 쓰기 권한이 있는지 확인하십시오.
tr: Dosyaya yazılamadı. Dosyanın yazılabilir olduğunu denetleyin.
vi: Không thể ghi vào tệp. Hãy kiểm tra xem tệp có cho phép ghi không.
zh_hans: 无法写入文件。请检查文件是否可写。
zh_hant: 無法寫入檔案。請檢查檔案是否可寫入。

source: Close the open session for a connection.
fr: Fermer la session ouverte pour établir une connexion.
ko: 연결의 열린 세션을 닫습니다.
tr: Bir bağlantı için açık oturumu kapatır.
vi: Đóng phiên đang mở của một kết nối.
zh_hans: 关闭某个连接已打开的会话。
zh_hant: 關閉某個連線已開啟的工作階段。

source: Kind:
fr: Genre :
ko: 종류:
tr: Tür:
vi: Loại:
zh_hans: 类型：
zh_hant: 類型：

source: Update the database driver in Settings > Plugins to run several statements in one call.
fr: Mettez à jour le pilote de base de données dans Paramètres > Plugins pour exécuter plusieurs instructions en une seule requête.

source: Unknown column(s): %@
fr: Colonne(s) inconnue(s) : %@
ko: 알 수 없는 열: %@
tr: Bilinmeyen sütun(lar): %@
vi: Cột không xác định: %@
zh_hans: 未知的列：%@
zh_hant: 未知的欄位：%@

source: Fetch an approximate row count per table (default false)
fr: Récupérer un nombre approximatif de lignes par table (par défaut faux)
ko: 테이블마다 대략적인 행 수를 가져옵니다(기본값 false)
tr: Tablo başına yaklaşık satır sayısı getirir (varsayılan false)
vi: Lấy số dòng ước tính cho mỗi bảng (mặc định false)
zh_hans: 为每张表获取大致行数（默认 false）
zh_hant: 為每張資料表取得大致列數（預設 false）

source: Show Previous Window Tab
fr: Afficher la barre d'onglets de la fenêtre
ko: 이전 윈도우 탭 보기
tr: Önceki Pencere Sekmesini Göster
vi: Hiện tab cửa sổ trước
zh_hans: 显示上一个窗口标签页
zh_hant: 顯示上一個視窗分頁

source: Favorite Database
fr: Base de données préférée
ko: 즐겨찾는 데이터베이스
tr: Sık Kullanılan Veritabanı
vi: Cơ sở dữ liệu Yêu thích
zh_hans: 收藏数据库
zh_hant: 收藏資料庫

source: Prompt template
fr: Modèle de prompt
ko: 프롬프트 템플릿
tr: İstem şablonu
vi: Mẫu prompt
zh_hans: 提示词模板
zh_hant: 提示詞範本

source: Tag name
fr: Nom de balise
ko: 태그 이름
tr: Etiket adı
vi: Tên thẻ
zh_hans: 标签名称
zh_hant: 標籤名稱

source: %@ is unbounded text or binary here, which this engine cannot index.
fr: %@ est du texte illimité ou binaire ici, ce que ce moteur ne peut pas indexer.

source: Loading page
fr: Chargement de la page
ko: 페이지 불러오는 중
tr: Sayfa yükleniyor
vi: Đang tải trang
zh_hans: 正在载入页面
zh_hant: 正在載入頁面

source: Failed to read file: %@
fr: Échec de la lecture du fichier : %@
ko: 파일을 읽지 못했습니다: %@
tr: Dosya okunamadı: %@
vi: Đọc tệp thất bại: %@
zh_hans: 读取文件失败: %@
zh_hant: 讀取檔案失敗：%@

source: Re-enter passphrase
fr: Récupérer le mot de passe
ko: 암호 구문 다시 입력
tr: Parolayı yeniden girin
vi: Nhập lại cụm mật khẩu
zh_hans: 再次输入口令
zh_hant: 再次輸入密碼

source: Connect %lld Connections
fr: Se connecter à %lld connexions
ko: %lld개 연결에 접속
tr: %lld Bağlantıyı Bağla
vi: Kết nối %lld Kết nối
zh_hans: 连接 %lld 个连接
zh_hant: 連線 %lld 個連線

source: Open-source vector database
fr: Base de données vectorielle open source

source: Switch to Recent Tab
fr: Passer à l'onglet Récents
ko: 최근 탭으로 전환
tr: Son Sekmeye Geç
vi: Chuyển đến tab gần đây
zh_hans: 切换到最近的标签页
zh_hant: 切換到最近的分頁

source: Delete this row?
fr: Supprimer cette ligne ?
ko: 이 행을 삭제하시겠습니까?
tr: Bu satır silinsin mi?
vi: Xóa dòng này?
zh_hans: 删除此行？
zh_hant: 要刪除這一列嗎？

source: Skip and continue
fr: Ouvrir et continuer
ko: 건너뛰고 계속하기
tr: Atla ve devam et
vi: Bỏ qua và tiếp tục
zh_hans: 跳过并继续
zh_hant: 略過並繼續

source: Export Failed
fr: Exportation échouée
ko: 내보내기 실패
tr: Dışa Aktarma Başarısız
vi: Xuất Thất bại
zh_hans: 导出失败
zh_hant: 匯出失敗

source: Passwords
fr: Mot de passe
ko: 암호
tr: Parolalar
vi: Mật khẩu
zh_hans: 密码
zh_hant: 密碼

source: The SSH server did not open a forwarding channel to %1$@ within %2$d seconds. Check for a firewall between the SSH server and that address.
fr: Le serveur SSH n'a pas ouvert un canal de redirection vers %1$@ dans %2$d secondes. Vérifiez s'il y a un pare-feu entre le serveur SSH et cette adresse.
ko: SSH 서버가 %2$d초 이내에 %1$@에 대한 전달 채널을 열지 못했습니다. SSH 서버와 해당 주소 사이에 방화벽이 있는지 확인하십시오.
tr: SSH sunucusu %2$d saniye içinde %1$@ adresine bir yönlendirme kanalı açmadı. SSH sunucusu ile bu adres arasında güvenlik duvarı olup olmadığını denetleyin.
vi: Máy chủ SSH không mở kênh chuyển tiếp tới %1$@ trong %2$d giây. Hãy kiểm tra tường lửa giữa máy chủ SSH và địa chỉ đó.
zh_hans: SSH 服务器未在 %2$d 秒内建立到 %1$@ 的转发通道。请检查 SSH 服务器与该地址之间是否有防火墙。
zh_hant: SSH 伺服器未在 %2$d 秒內建立到 %1$@ 的轉送通道。請檢查 SSH 伺服器與該位址之間是否有防火牆。

source: %@ cannot make this change to a table's columns.
fr: %@ ne peut pas apporter cette modification aux colonnes d’un tableau.

source: Database that was searched
fr: Base de données que l'on a recherchée

source: Import failed
fr: Importation échouée
ko: 가져오기 실패
tr: İçe aktarma başarısız
vi: Nhập thất bại
zh_hans: 导入失败
zh_hant: 匯入失敗

source: Get Table DDL
fr: Obtenir la DDL de la table
ko: 테이블 DDL 가져오기
tr: Tablo DDL'sini Al
vi: Lấy DDL của bảng
zh_hans: 获取表 DDL
zh_hant: 取得資料表 DDL

source: NULL
fr: Nul

source: CREATE statement
fr: Déclaration de CRÉATION
ko: CREATE 구문
tr: CREATE ifadesi
vi: Câu lệnh CREATE
zh_hans: CREATE 语句
zh_hant: CREATE 陳述式

source: Dropping materialized view %@ discards its stored rows, comments and privileges. The rows are computed again and the source's indexes are created on it.
fr: Le dépôt de la vue matérialisée %@ rejette ses lignes, commentaires et privilèges stockés. Les lignes sont recomputées et les index de la source sont créés dessus.

source: Unpin baseline
fr: Dépinage de la ligne de base
ko: 기준 고정 해제
tr: Temel plan sabitlemesini kaldır
vi: Bỏ ghim bản gốc
zh_hans: 取消固定基准
zh_hant: 取消固定基準

source: Database name to switch to
fr: Nom de la base de données à laquelle passer
ko: 전환할 데이터베이스 이름
tr: Geçiş yapılacak veritabanı adı
vi: Tên cơ sở dữ liệu cần chuyển sang
zh_hans: 要切换到的数据库名称
zh_hant: 要切換到的資料庫名稱

source: Copy install command
fr: Copier la commande d'installation
ko: 설치 명령 복사
tr: Kurulum komutunu kopyala
vi: Sao chép lệnh cài đặt
zh_hans: 复制安装命令
zh_hant: 複製安裝指令

source: Showing saved plugin list. %@
fr: Affichage de la liste des plugins enregistrés. %@
ko: 저장된 플러그인 목록을 표시합니다. %@
tr: Kaydedilmiş eklenti listesi gösteriliyor. %@
vi: Đang hiển thị danh sách plugin đã lưu. %@
zh_hans: 正在显示已保存的插件列表。%@
zh_hant: 正在顯示已儲存的外掛清單。%@

source: Key Passphrase
fr: Phrase de passe clé
ko: 키 암호
tr: Anahtar Parolası
vi: Cụm mật khẩu của khóa
zh_hans: 密钥口令
zh_hant: 金鑰密碼短語

source: Address
fr: Adresse
ko: 주소
tr: Adres
vi: Địa chỉ
zh_hans: 地址
zh_hant: 位址

source: Show recent tables
fr: Afficher les tableaux récents
ko: 최근 테이블 보기
tr: Son tabloları göster
vi: Hiện bảng gần đây
zh_hans: 显示最近的表
zh_hant: 顯示最近的資料表
